Repository: JuanKy568/Zyntra
Catalog: lib/l10n/app_*.arb
Languages: es

# welcome
source: Welcome to Zyntra!
es: ¡Bienvenido a Zyntra!

source: Email
es: Correo electrónico

source: Password
es: Contraseña

source: Login
es: Iniciar sesión

# noAccount
source: Don't have an account? Register here
es: ¿No tienes cuenta? Regístrate aquí

# developedBy
source: Developed by: Aguirre & Díaz
es: Desarrollado por: Aguirre y Díaz

source: Create Account
es: CREAR CUENTA

source: Full Name
es: Nombre completo

source: Age
es: Edad

# height
source: Height (m)
es: Altura (m)

# weight
source: Weight (kg)
es: Peso (kg)

source: Training Level
es: Nivel de entrenamiento

source: Recruit
es: Recluta

source: Cadet
es: Cadete

source: Warrior
es: Guerrero

source: Gladiator
es: Gladiador

source: Elite
es: Élite

source: Master
es: Maestro

source: Titan
es: Titán

source: Legend
es: Leyenda

source: Confirm Password
es: Confirmar contraseña

source: Register
es: Registrarse

# alreadyHaveAccount
source: Already have an account? Sign in
es: ¿Ya tienes cuenta? Inicia sesión

# enterName
source: Enter your name
es: Ingrese su nombre

# enterAge
source: Enter your age
es: Ingrese su edad

# enterHeight
source: Enter your height
es: Ingrese su altura

# enterWeight
source: Enter your weight
es: Ingrese su peso

# enterEmail
source: Enter your email
es: Ingrese su correo

# enterPassword
source: Enter a password
es: Ingrese una contraseña

source: Confirm your password
es: Confirme su contraseña

source: Passwords do not match
es: Las contraseñas no coinciden

source: Invalid email
es: Correo inválido

# minCharacters
source: Minimum 6 characters
es: Mínimo 6 caracteres

# userRegistered
source: User registered successfully ✅
es: Usuario registrado correctamente ✅

# loginError
source: Error while signing in
es: Error al iniciar sesion

# loginSuccess
source: Login successful ✅
es: Inicio de sesión exitoso ✅

# userInfo
source: User Information
es: Información del Usuario

source: Name
es: Nombre

source: Level
es: Nivel

# trainings
source: Workouts
es: Entrenamientos

source: Progress
es: Progreso

source: Store
es: Tienda

source: Settings
es: Configuración

source: years
es: años

# gymTitle
source: Virtual Gym
es: Gimnasio Virtual

source: Log out
es: Cerrar sesión

source: Profile Settings
es: Configuración de Perfil

source: Save Changes
es: Guardar cambios

# dataUpdated
source: Data updated successfully ✅
es: Datos actualizados correctamente ✅

source: Accessories
es: Accesorios

source: VIP Avatars
es: Avatares VIP

source: coins
es: monedas

source: Recharge
es: Recargar

source: Buy
es: Comprar

source: Not enough coins 💸
es: No tienes suficientes monedas 💸

# purchaseSuccess
source: You purchased {item} ✅
es: Has comprado {item} ✅

# userCoinsLabel
source: 💰 {amount} coins
es: 💰 {amount} monedas

# titanGold
source: Golden Titan
es: Titán Dorado

source: Cyber Warrior
es: Guerrero Cibernético

# masterPower
source: Master of Power
es: Maestro de la Fuerza

# accessoryDescription1
source: Scientifically developed whey isolate formula.
es: Fórmula científicamente desarrollada de aislado de suero

# accessoryDescription2
source: Powder that combines isomaltulose and amino acids
es: Polvo que combina isomaltulosa y aminoácidos

# accessoryDescription3
source: Hexagonal Dumbbell Rack
es: Rack para Mancuernas Hexagonales

# avatarDescription1
source: Legendary four-legged avatar
es: Avatar legendario de 4 patas

# avatarDescription2
source: Futuristic design with green energy
es: Diseño futurista con energía verde

# avatarDescription3
source: Exclusive elite avatar
es: Avatar exclusivo de élite

# rechargeSuccess
source: You earned 500 coins 💰
es: Has ganado 500 monedas 💰

# purchaseCompleted
source: Purchased ✅
es: Comprado ✅

# adLoading
source: Loading ad... please try again
es: Cargando anuncio... inténtalo de nuevo

source: Activate
es: Activar

source: Deactivate
es: Desactivar

source: activated!
es: activado!

source: deactivated!
es: desactivado!

source: Strength
es: Fuerza

source: Endurance
es: Resistencia

source: Flexibility
es: Flexibilidad

source: Level Progress
es: Progreso de nivel

source: Nutrition
es: Nutrición

source: Hello
es: Hola

source: Resistance
es: Resistencia

# force
source: Strength
es: Fuerza

source: Today
es: Hoy

# planSomething
source: Plan a workout while the day is still young!
es: ¡Planifica un entrenamiento mientras el día aún es joven!

# planNow
source: Plan something
es: Planifica algo

# noEventsYet
source: You don't have any events yet
es: Aún no tienes eventos registrados

source: Planned Events
es: Eventos planificados

source: Add Event
es: Agregar evento

source: Save
es: Guardar

# completeAllFields
source: Please complete all fields
es: Por favor completa todos los campos

source: Cancel
es: Cancelar

source: Select time
es: Seleccionar hora

source: Select date
es: Seleccionar fecha

source: Event description
es: Descripción del evento

# planEvent
source: Plan a new event
es: Planificar nuevo evento

# training
source: Resistance training
es: Entrenamiento de Resistencia

# progress_r
source: Resistance progress
es: Progreso de resistencia

# congratulations
source: 🏆 Congratulations! You have earned 100 points
es: 🏆 ¡Felicidades! Has ganado 100 puntos

# excellent
source: 🔥 Excellent! Your stamina has increased
es: 🔥 ¡Excelente! Tu resistencia ha aumentado

# r_name1
source: Strenuous hike
es: Caminata intensa

# r_name2
source: Skipping rope
es: Saltar la cuerda

# r_name3
source: Cycling
es: Ciclismo

# r_name4
source: Go up stairs
es: Subir escaleras

# r_description1
source: Walk briskly for 30 minutes
es: Camina a paso rápido durante 30 minutos

# r_description2
source: Perform 3 sets of 2 minutes of jumping
es: Realiza 3 sesiones de 2 minutos de salto

# r_description3
source: Cycle for 40 minutes at a moderate pace
es: Andar en bicicleta durante 40 minutos a ritmo moderado

# r_description4
source: Climb stairs for 10 minutes without stopping
es: Sube escaleras por 10 minutos sin parar

# add
source: Add new exercise
es: Agregar nuevo ejercicio

# name_add
source: Exercise Name
es: Nombre del ejercicio

# des_add
source: Description
es: Descripción

# aum_add
source: Progress increase (0.01 - 0.2)
es: Aumento de progreso (0.01 - 0.2)

# btn_add
source: Add
es: Agregar

# btn_cancel
source: Cancel
es: Cancelar

# nutrition_title
source: Nutrition Plans
es: Planes de Nutrición

source: Nutrition Progress
es: Progreso Nutricional

# diet_name1
source: Balanced Diet
es: Dieta balanceada

# diet_desc1
source: Includes fruits, vegetables, lean proteins and whole grains.
es: Incluye frutas, verduras, proteínas magras y granos integrales.

# diet_name2
source: High Protein
es: Alta en proteínas

# diet_desc2
source: Based on lean meats, legumes and eggs. Ideal for muscle growth.
es: Basada en carnes magras, legumbres y huevos. Ideal para ganar masa muscular.

# diet_name3
source: Healthy Vegan
es: Vegana saludable

# diet_desc3
source: Focused on plant foods rich in fiber and antioxidants.
es: Enfocada en alimentos vegetales ricos en fibra y antioxidantes.

# diet_name4
source: Low Calorie Definition
es: Definición baja en calorías

# diet_desc4
source: Designed to reduce fat while preserving muscle masa.
es: Diseñada para reducir grasa corporal manteniendo masa muscular.

# nutrition_improved
source: 🥗 Great! Your nutrition progress has improved.
es: 🥗 ¡Excelente! Tu progreso nutricional ha mejorado.

# nutrition_congrats
source: 🎉 Congratulations! You earned 100 points for your nutrition progress.
es: 🎉 ¡Felicidades! Has ganado 100 puntos por tu progreso nutricional.

# nutrition_add_title
source: Add New Diet
es: Agregar nueva dieta

# nutrition_add_name
source: Diet Name
es: Nombre de la dieta

# cat_chest
source: Chest
es: Pecho

# cat_back
source: Back
es: Espalda

# cat_biceps
source: Biceps
es: Bíceps

# cat_triceps
source: Triceps
es: Tríceps

# cat_forearm
source: Forearm
es: Antebrazo

# force_title
source: Strength Training
es: Entrenamiento de Fuerza

# force_progress
source: Strength Progress
es: Progreso de Fuerza

# force_add_title
source: Add New Exercise
es: Agregar nuevo ejercicio

# force_add_name
source: Exercise Name
es: Nombre del ejercicio

# force_add_desc
source: Description
es: Descripción

# force_add_cat
source: Muscle Category
es: Categoría muscular

# force_add_inc
source: Progress Increment (0.01 - 0.2)
es: Aumento de progreso (0.01 - 0.2)

# force_congrats
source: 🏋️‍♂️ Incredible! You've earned 100 points.
es: 🏋️‍♂️ ¡Increíble! Has ganado 100 puntos.

# force_improved
source: 💪 Excellent! Your strength has increased.
es: 💪 ¡Excelente! Tu fuerza ha aumentado.

# f_name1
source: Bench Press
es: Press de banca

# f_desc1
source: Classic exercise for developing the chest.
es: Ejercicio clásico para desarrollar el pecho.

# f_name2
source: Push-ups
es: Flexiones

# f_desc2
source: Bodyweight exercise for strength and endurance.
es: Ejercicio con peso corporal para fuerza y resistencia.

# f_name3
source: Dumbbell Flyes
es: Aperturas con mancuernas

# f_desc3
source: Works the pectoralis major muscles with a wide range of motion.
es: Trabaja los pectorales mayores con amplitud.

# f_name4
source: Pull-ups
es: Dominadas

# f_desc4
source: Strengthens the back and biceps.
es: Fortalece la espalda y los bíceps.

# f_name5
source: Barbell row
es: Remo con barra

# f_desc5
source: Develops the mid-back.
es: Desarrolla la parte media de la espalda.

# f_name6
source: Deadlift
es: Peso muerto

# f_desc6
source: Compound exercise that engages the entire back.
es: Ejercicio compuesto que involucra toda la espalda.

# f_name7
source: Barbell curl
es: Curl con barra

# f_desc7
source: Increases bicep size and strength.
es: Aumenta el tamaño y fuerza de los bíceps.

# f_name8
source: Dumbbell curl
es: Curl con mancuernas

# f_desc8
source: Allows for a more natural and controlled movement.
es: Permite un movimiento más natural y controlado.

# f_name9
source: Hammer curl
es: Martillo

# f_desc9
source: Works the brachialis and forearm.
es: Trabaja el braquial y el antebrazo.

# f_name10
source: Parallel Bar Dips
es: Fondos en paralelas

# f_desc10
source: A demanding exercise for triceps and chest.
es: Ejercicio exigente para tríceps y pecho.

# f_name11
source: Rope Extensions
es: Extensiones con cuerda

# f_desc11
source: Ideal for defining the triceps.
es: Ideal para definir los tríceps.

# f_name12
source: French Press
es: Press francés

# f_desc12
source: Focuses on the long head of the triceps.
es: Enfoca el trabajo en el tríceps largo.

# f_name13
source: Wrist Curl
es: Curl de muñeca

# f_desc13
source: Strengthens the forearm flexor muscles.
es: Fortalece los músculos flexores del antebrazo.

# f_name14
source: Reverse Curl
es: Curl inverso

# f_desc14
source: Works extensors and the upper part of the forearm.
es: Trabaja extensores y parte superior del antebrazo.

# f_name15
source: Towel Hold
es: Toalla hold

# f_desc15
source: Develops grip strength.
es: Desarrolla la fuerza de agarre.

# f_name16
source: Abdominal Crunches
es: Abdominales crunch

# f_desc16
source: Basic exercise for the upper abs.
es: Ejercicio básico para la parte superior del abdomen.

# f_name17
source: Plank
es: Plancha

# f_desc17
source: Strengthens the entire core.
es: Fortalece todo el core.

# f_name18
source: Leg raises
es: Elevaciones de piernas

# f_desc18
source: Works the lower abs and stability.
es: Trabaja el abdomen inferior y la estabilidad.
